sorosaulong-ux/gd32-test-project/Library/gd32a7xx_qspi.c
/*!
    \file    gd32a7xx_qspi.c
    \brief   QSPI driver

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32a7xx_qspi.h"

/* QSPI register bit offset */
#define CTL_FTL_OFFSET                   ((uint32_t)0x00000008U)               /*!< bit offset of FTL in QSPI_CTL */
#define CTL_PSC_OFFSET                   ((uint32_t)0x00000018U)               /*!< bit offset of PSC in QSPI_CTL */
#define DCFG_FMSZ_OFFSET                 ((uint32_t)0x00000010U)               /*!< bit offset of FMSZ in QSPI_DCFG */
#define TCFG_DUMYC_OFFSET                ((uint32_t)0x00000012U)               /*!< bit offset of DUMYC in QSPI_TCFG */
#define CTL_OUTPUT_CK_DELAY_OFFSET       ((uint32_t)0x0000000CU)               /*!< bit offset of OCKDV in QSPI_CTL */

/* CPDM mask */
#define CPDM_CPSEL_MASK                  ((uint32_t)0xFFFFFFF0U)               /*!< CPDM output clock phase seclection mask */
#define CPDM_DLSTCNT_MASK                ((uint32_t)0xFFFF80FFU)               /*!< CPDM delay step count for a uint delay UINT mask */
#define CPDM_DLLENF_MASK                 ((uint32_t)0x80000000U)               /*!< CPDM delay line length valid flag mask */
#define CPDM_DLLEN_MASK                  ((uint32_t)0x0FFF0000U)               /*!< CPDM delay line length mask */

/* CPDM configure */
#define CPDM_DLLEN_OFFSET                ((uint32_t)16U)                       /*!< CPDM delay line length offset */
#define CPDM_DLSTCNT_OFFSET              ((uint32_t)8U)                        /*!< CPDM delay step count for a uint delay UINT offset */
#define CPDM_DLLEN_11                    ((uint32_t)0x08000000U)               /*!< CPDM delay line length bit 11 */
#define CPDM_DLLEN_10                    ((uint32_t)0x04000000U)               /*!< CPDM delay line length bit 10 */
#define CPDM_DLLEN_10_0_MASK             ((uint32_t)0x7FFU)                    /*!< CPDM delay line length bit 10 to bit 0 mask */
#define CPDM_MAX_TIMEOUT                 ((uint32_t)0x0000FFFFU)               /*!< count to judge of CPDM timeout */

/* configure QSPI functional mode */
static void qspi_config(qspi_command_struct *cmd, uint32_t functionalmode);

/*!
    \brief      reset QSPI (API_ID: 0x0001U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_deinit(void)
{
    /* reset QSPI register */
    QSPI_CTL      = 0x00000010U;
    QSPI_DCFG     = 0x001F0000U;
    QSPI_STATC    = 0x00000000U;
    QSPI_DTLEN    = 0x00000000U;
    QSPI_TCFG     = 0x00000000U;
    QSPI_ADDR     = 0x00000000U;
    QSPI_ALTE     = 0x00000000U;
    QSPI_DATA     = 0x00000000U;
    QSPI_STATMK   = 0x00000000U;
    QSPI_STATMATCH = 0x00000000U;
    QSPI_INTERVAL = 0x00000000U;
    QSPI_TMOUT    = 0x00000000U;
    QSPI_FLUSH    = 0x00000000U;
    CPDM_CTL      = 0x00000000U;
    CPDM_CFG      = 0x00000000U;
    /* reset QSPI */
    rcu_periph_reset_enable(RCU_QSPIRST);
    rcu_periph_reset_disable(RCU_QSPIRST);
}

/*!
    \brief      initialize the parameters of QSPI struct with the default values (API_ID: 0x0002U)
    \param[in]  none
    \param[out] init_para: QSPI parameter struct
    \retval     none
*/
void qspi_struct_para_init(qspi_init_struct *init_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(init_para)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif
    {
        /* set the QSPI struct with the default values */
        init_para->clock_mode     = QSPI_CLOCK_MODE_LOW;
        init_para->prescaler      = 3U;
        init_para->fifo_threshold = 16U;
        init_para->sample_shift   = QSPI_SAMPLE_SHIFTING_NONE;
        init_para->flash_size     = 0x1FU;
        init_para->cs_high_time   = QSPI_CS_HIGH_TIME_1_CYCLE;
    }
}

/*!
    \brief      initialize the parameters of QSPI command struct with the default values (API_ID: 0x0003U)
    \param[in]  none
    \param[out] init_para: QSPI command parameter struct
    \retval     none
*/
void qspi_cmd_struct_para_init(qspi_command_struct *init_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(init_para)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else
#endif
    {
        /* set the QSPI command struct with the default values */
        init_para->instruction_mode = QSPI_INSTRUCTION_NONE;
        init_para->instruction      = 0U;
        init_para->addr_mode        = QSPI_ADDR_NONE;
        init_para->addr_size        = QSPI_ADDR_8_BITS;
        init_para->addr             = 0U;
        init_para->altebytes_mode   = QSPI_ALTE_BYTES_NONE;
        init_para->altebytes_size   = QSPI_ALTE_BYTES_8_BITS;
        init_para->altebytes        = 0U;
        init_para->dummycycles      = 0U;
        init_para->data_mode        = QSPI_DATA_NONE;
        init_para->data_length      = 0U;
        init_para->sioo_mode        = QSPI_SIOO_INST_EVERY_CMD;
        init_para->trans_rate       = 0U;
        init_para->trans_delay      = 0U;
    }
}

/*!
    \brief      initialize the parameters of QSPI read polling struct with the default values (API_ID: 0x0004U)
    \param[in]  none
    \param[out] init_para: QSPI read polling parameter struct
    \retval     none
*/
void qspi_polling_struct_para_init(qspi_polling_struct *init_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(init_para)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0004U), ERR_PARAM_POINTER);
    } else
#endif
    {
        /* set the QSPI read polling struct with the default values */
        init_para->match            = 0U;
        init_para->mask             = 0U;
        init_para->interval         = 0U;
        init_para->statusbytes_size = 1;
        init_para->match_mode       = QSPI_MATCH_MODE_AND;
        init_para->polling_stop     = QSPI_POLLING_STOP_DISABLE;
    }
}

/*!
    \brief      initialize QSPI parameter (API_ID: 0x0005U)
    \param[in]  qspi_struct: QSPI parameter initialization stuct members of the structure
                            and the member values are shown as below:
                  prescaler: between 1 and 256
                  fifo_threshold: between 1 and 16
                  sample_shift: QSPI_SAMPLE_SHIFTING_NONE, QSPI_SAMPLE_SHIFTING_HALFCYCLE
                  flash_size: between 0 and 28
                  cs_high_time: QSPI_CS_HIGH_TIME_1_CYCLE, QSPI_CS_HIGH_TIME_2_CYCLE, QSPI_CS_HIGH_TIME_3_CYCLE,
                                QSPI_CS_HIGH_TIME_4_CYCLE, QSPI_CS_HIGH_TIME_5_CYCLE, QSPI_CS_HIGH_TIME_6_CYCLE,
                                QSPI_CS_HIGH_TIME_7_CYCLE, QSPI_CS_HIGH_TIME_8_CYCLE
                  clock_mode: QSPI_CLOCK_MODE_LOW, QSPI_CLOCK_MODE_HIGH
    \param[out] none
    \retval     none
*/
void qspi_init(qspi_init_struct *qspi_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(qspi_struct)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0005U), ERR_PARAM_POINTER);
    } else if(NOT_QSPI_CLOCK_MODE(qspi_struct->clock_mode)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_PRESCALER(qspi_struct->prescaler)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_FIFO_THREAHOLD(qspi_struct->fifo_threshold)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_SAMPLE_SHIFT(qspi_struct->sample_shift)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_FLASH_SIZE(qspi_struct->flash_size)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_CS_HIGH_TIME(qspi_struct->cs_high_time)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* configure prescaler, sample_shift, fifo_threshold */
        QSPI_CTL &= ~(QSPI_CTL_PSC | QSPI_CTL_SSAMPLE | QSPI_CTL_FTL);
        QSPI_CTL |= ((qspi_struct->prescaler - 1U) << CTL_PSC_OFFSET) | qspi_struct->sample_shift | ((
                                                                                                         qspi_struct->fifo_threshold - 1U) << CTL_FTL_OFFSET);

        /* configure flash_size, cs_high_time, clock_mode */
        QSPI_DCFG &= ~((QSPI_DCFG_FMSZ) | QSPI_DCFG_CSHC | QSPI_DCFG_CKMOD);
        QSPI_DCFG |= ((qspi_struct->flash_size << DCFG_FMSZ_OFFSET) | qspi_struct->cs_high_time |
                      qspi_struct->clock_mode);
    }
}

/*!
    \brief      enable QSPI (API_ID: 0x0006U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_enable(void)
{
    QSPI_CTL |= (uint32_t)QSPI_CTL_QSPIEN;
}

/*!
    \brief      disable QSPI (API_ID: 0x0007U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_disable(void)
{
    QSPI_CTL &= (uint32_t)(~QSPI_CTL_QSPIEN);
}

/*!
    \brief      enable QSPI DMA (API_ID: 0x0008U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_dma_enable(void)
{
    QSPI_CTL |= (uint32_t)(QSPI_CTL_DMAEN);
}

/*!
    \brief      disable QSPI DMA (API_ID: 0x0009U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_dma_disable(void)
{
    QSPI_CTL &= (uint32_t)(~QSPI_CTL_DMAEN);
}

/*!
    \brief      configure QSPI command parameters (API_ID: 0x000AU)
    \param[in]  cmd: QSPI command parameter initialization stuct members of the structure
                             and the member values are shown as below:
                  instruction_mode: QSPI_INSTRUCTION_NONE, QSPI_INSTRUCTION_1_LINE,
                                    QSPI_INSTRUCTION_2_LINES, QSPI_INSTRUCTION_4_LINES
                  instruction: reference flash commands description
                  addr_mode: QSPI_ADDR_NONE, QSPI_ADDR_1_LINE, QSPI_ADDR_2_LINES, QSPI_ADDR_4_LINES
                  addr_size: QSPI_ADDR_8_BITS, QSPI_ADDR_16_BITS, QSPI_ADDR_24_BITS, QSPI_ADDR_32_BITS
                  addr: 0-flash size
                  altebytes_mode: QSPI_ALTE_BYTES_NONE, QSPI_ALTE_BYTES_1_LINE,
                                  QSPI_ALTE_BYTES_2_LINES, QSPI_ALTE_BYTES_4_LINES
                  altebytes_size: QSPI_ALTE_BYTES_8_BITS, QSPI_ALTE_BYTES_16_BITS,
                                  QSPI_ALTE_BYTES_24_BITS, QSPI_ALTE_BYTES_32_BITS
                  altebytes: 0-0xFFFFFFFF
                  dummycycles: between 0 and 31
                  data_mode: QSPI_DATA_NONE, QSPI_DATA_1_LINE, QSPI_DATA_2_LINES, QSPI_DATA_4_LINES
                  data_length: 0-0xFFFFFFFF
                  sioo_mode: QSPI_SIOO_INST_EVERY_CMD, QSPI_SIOO_INST_ONLY_FIRST_CMD
                  trans_rate: QSPI_SDR_MODE, QSPI_DDR_MODE
                  trans_delay: QSPI_DDR_HOLD_DISABLE, QSPI_DDR_HOLD_ENABLE
    \param[out] none
    \retval     none
*/
void qspi_command_config(qspi_command_struct *cmd)
{
    uint16_t timeout = QSPI_COMMAND_CONFIG_TOMEOUT;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(cmd)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000AU), ERR_PARAM_POINTER);
    } else if(NOT_QSPI_INSTRUCTIN_MODE(cmd->instruction_mode)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000AU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_INSTRUCTIN(cmd->instruction)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000AU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_ADDR_MODE(cmd->addr_mode)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000AU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_ADDR_SIZE(cmd->addr_size)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000AU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_ALTEBYTES_MODE(cmd->altebytes_mode)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000AU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_ALTEBYTES_SIZE(cmd->altebytes_size)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000AU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_DUMMYCYCLES(cmd->dummycycles)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000AU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_DATA_MODE(cmd->data_mode)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000AU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_SIOO_MODE(cmd->sioo_mode)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000AU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_TRANS_RATE(cmd->trans_rate)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000AU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_TRANS_DELAY(cmd->trans_delay)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000AU), ERR_PARAM_INVALID);
    } else
#endif
    {
        qspi_disable();
        qspi_enable();

