sorosaulong-ux/gd32-test-project/Library/gd32a7xx_qspi.c
        /* call the configuration function */
        qspi_config(cmd, QSPI_NORMAL_WRITE);

        if(cmd->data_mode == QSPI_DATA_NONE) {
            /* when there is no data phase, the transfer start as soon as the configuration is done
            so wait until TC flag is set to go back in idle state */
            while(((QSPI_STAT & QSPI_FLAG_TC ) == 0U) && (timeout > 0U)){
                timeout--;
            }
            QSPI_STATC = QSPI_STATC_TCC;
        }
    }
}

/*!
    \brief      configure QSPI read polling mode (API_ID: 0x000BU)
    \param[in]  cmd: QSPI command parameter initialization stuct members of the structure
                             and the member values are shown as below:
                  instruction_mode: QSPI_INSTRUCTION_NONE, QSPI_INSTRUCTION_1_LINE,
                                    QSPI_INSTRUCTION_2_LINES, QSPI_INSTRUCTION_4_LINES
                  instruction: reference flash commands description
                  addr_mode: QSPI_ADDR_NONE, QSPI_ADDR_1_LINE, QSPI_ADDR_2_LINES, QSPI_ADDR_4_LINES
                  addr_size: QSPI_ADDR_8_BITS, QSPI_ADDR_16_BITS, QSPI_ADDR_24_BITS, QSPI_ADDR_32_BITS
                  addr: 0-flash size
                  altebytes_mode: QSPI_ALTE_BYTES_NONE, QSPI_ALTE_BYTES_1_LINE,
                                  QSPI_ALTE_BYTES_2_LINES, QSPI_ALTE_BYTES_4_LINES
                  altebytes_size: QSPI_ALTE_BYTES_8_BITS, QSPI_ALTE_BYTES_16_BITS,
                                  QSPI_ALTE_BYTES_24_BITS, QSPI_ALTE_BYTES_32_BITS
                  altebytes: 0-0xFFFFFFFF
                  dummycycles: between 0 and 31
                  data_mode: QSPI_DATA_NONE, QSPI_DATA_1_LINE, QSPI_DATA_2_LINES, QSPI_DATA_4_LINES
                  data_length: 0-0xFFFFFFFF
                  sioo_mode: QSPI_SIOO_INST_EVERY_CMD, QSPI_SIOO_INST_ONLY_FIRST_CMD
                  trans_rate: QSPI_SDR_MODE, QSPI_DDR_MODE
                  trans_delay: QSPI_DDR_HOLD_DISABLE, QSPI_DDR_HOLD_ENABLE
    \param[in]  cfg: read polling struct initialization stuct members of the structure
                             and the member values are shown as below:
                  match: between 0 and 0xFFFFFFFF
                  mask: between 0 and 0xFFFFFFFF
                  interval: between 0 and 0xFFFF
                  statusbytes_size: between 1 and 4
                  match_mode: QSPI_MATCH_MODE_AND, QSPI_MATCH_MODE_OR
                  polling_stop: QSPI_POLLING_STOP_DISABLE,QSPI_POLLING_STOP_ENABLE
    \param[out] none
    \retval     none
*/
void qspi_polling_config(qspi_command_struct *cmd, qspi_polling_struct *cfg)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(cmd)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000BU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(cfg)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000BU), ERR_PARAM_POINTER);
    } else if(NOT_QSPI_INSTRUCTIN_MODE(cmd->instruction_mode)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_INSTRUCTIN(cmd->instruction)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_ADDR_MODE(cmd->addr_mode)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_ADDR_SIZE(cmd->addr_size)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_ALTEBYTES_MODE(cmd->altebytes_mode)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_ALTEBYTES_SIZE(cmd->altebytes_size)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_DUMMYCYCLES(cmd->dummycycles)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_DATA_MODE(cmd->data_mode)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_SIOO_MODE(cmd->sioo_mode)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_TRANS_RATE(cmd->trans_rate)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_TRANS_DELAY(cmd->trans_delay)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_NUM_CLK_CYC(cfg->interval)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_SATUSBYTES_SIZE(cfg->statusbytes_size)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_MATCH_MODE(cfg->match_mode)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000BU), ERR_PERIPH);
    } else if(NOT_QSPI_POLLING_STOP(cfg->polling_stop)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* configure the match value */
        QSPI_STATMATCH = cfg->match;
        /* configure the mask value */
        QSPI_STATMK = cfg->mask;
        /* configure the interval cycle */
        QSPI_INTERVAL = cfg->interval;
        /* configure the read polling match mode and read polling mode stop */
        QSPI_CTL &= ~(QSPI_CTL_RPMS | QSPI_CTL_RPMM);
        QSPI_CTL |= (cfg->match_mode | cfg->polling_stop);

        cmd->data_length = cfg->statusbytes_size;
        qspi_config(cmd, QSPI_READ_POLLING);
    }
}

/*!
    \brief      configure QSPI memory mapped mode (API_ID: 0x000CU)
    \param[in]  cmd: QSPI command parameter initialization stuct members of the structure
                             and the member values are shown as below:
                  instruction_mode: QSPI_INSTRUCTION_NONE, QSPI_INSTRUCTION_1_LINE,
                                    QSPI_INSTRUCTION_2_LINES, QSPI_INSTRUCTION_4_LINES
                  instruction: reference flash commands description
                  addr_mode: QSPI_ADDR_NONE, QSPI_ADDR_1_LINE, QSPI_ADDR_2_LINES, QSPI_ADDR_4_LINES
                  addr_size: QSPI_ADDR_8_BITS, QSPI_ADDR_16_BITS, QSPI_ADDR_24_BITS, QSPI_ADDR_32_BITS
                  addr: 0-flash size
                  altebytes_mode: QSPI_ALTE_BYTES_NONE, QSPI_ALTE_BYTES_1_LINE,
                                  QSPI_ALTE_BYTES_2_LINES, QSPI_ALTE_BYTES_4_LINES
                  altebytes_size: QSPI_ALTE_BYTES_8_BITS, QSPI_ALTE_BYTES_16_BITS,
                                  QSPI_ALTE_BYTES_24_BITS, QSPI_ALTE_BYTES_32_BITS
                  altebytes: 0-0xFFFFFFFF
                  dummycycles: between 0 and 31
                  data_mode: QSPI_DATA_NONE, QSPI_DATA_1_LINE, QSPI_DATA_2_LINES, QSPI_DATA_4_LINES
                  data_length: 0-0xFFFFFFFF
                  sioo_mode: QSPI_SIOO_INST_EVERY_CMD, QSPI_SIOO_INST_ONLY_FIRST_CMD
                  trans_rate: QSPI_SDR_MODE, QSPI_DDR_MODE
                  trans_delay: QSPI_DDR_HOLD_DISABLE, QSPI_DDR_HOLD_ENABLE
    \param[in]  timeout: 0-0xFFFF
    \param[in]  toen:
      \arg        QSPI_TMOUT_DISABLE: disable timeout counter
      \arg        QSPI_TMOUT_ENABLE: enable timeout counter
    \param[out] none
    \retval     none
*/
void qspi_memorymapped_config(qspi_command_struct *cmd, uint16_t timeout, uint32_t toen)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(cmd)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000CU), ERR_PARAM_POINTER);
    } else if(NOT_QSPI_INSTRUCTIN_MODE(cmd->instruction_mode)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000CU), ERR_PERIPH);
    } else if(NOT_QSPI_INSTRUCTIN(cmd->instruction)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000CU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_ADDR_MODE(cmd->addr_mode)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000CU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_ADDR_SIZE(cmd->addr_size)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000CU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_ALTEBYTES_MODE(cmd->altebytes_mode)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000CU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_ALTEBYTES_SIZE(cmd->altebytes_size)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000CU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_DUMMYCYCLES(cmd->dummycycles)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000CU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_DATA_MODE(cmd->data_mode)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000CU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_SIOO_MODE(cmd->sioo_mode)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000CU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_TRANS_RATE(cmd->trans_rate)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000CU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_TRANS_DELAY(cmd->trans_delay)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000CU), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_TIMEOUT_COUNT(toen)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000CU), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* enable timeout */
        QSPI_CTL &= ~QSPI_CTL_TMOUTEN;
        QSPI_CTL |= toen;

