sorosaulong-ux/gd32-test-project/Library/gd32a7xx_qspi.c
        if(toen == QSPI_CTL_TMOUTEN) {
            /* configure the timeout value */
            QSPI_TMOUT = timeout;
            QSPI_STATC = QSPI_STATC_TMOUTC;
            /* enable the QSPI timeout interrupt */
            QSPI_CTL |= QSPI_CTL_TMOUTIE;
        }
        qspi_config(cmd, QSPI_MEMORY_MAPPED);
    }
}

/*!
    \brief      QSPI transmit data function (API_ID: 0x000DU)
    \param[in]  tdata: pointer to the data to be transmitted
    \param[out] none
    \retval     none
*/
void qspi_data_transmit(uint8_t *tdata)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(tdata)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000DU), ERR_PARAM_POINTER);
    } else
#endif
    {
        uint32_t tx_cnt;
        uint16_t timeout = QSPI_DATA_TRANSMIT_TOMEOUT;
        tx_cnt = QSPI_DTLEN + 1U;

        qspi_disable();
        QSPI_TCFG = (QSPI_TCFG & ~QSPI_TCFG_FMOD) | QSPI_NORMAL_WRITE;
        qspi_enable();

        while(tx_cnt > 0U) {
            while(((QSPI_STAT & QSPI_FLAG_FT ) == 0U) && (timeout > 0U)){
                timeout--;
            }
            /* transmit data */
            *(uint8_t *)(QSPI + 0x00000020U) = *tdata++;
            tx_cnt--;
        }
    }
}

/*!
    \brief      QSPI receive data function (API_ID: 0x000EU)
    \param[in]  none
    \param[out] rdata: pointer to the data to be received
    \retval     none
*/
void qspi_data_receive(uint8_t *rdata)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(rdata)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000EU), ERR_PARAM_POINTER);
    } else
#endif
    {
        uint32_t rx_cnt, addr;
        uint16_t timeout = QSPI_DATA_RECEIVE_TOMEOUT;
        rx_cnt = QSPI_DTLEN + 1U;
        addr = QSPI_ADDR;

        qspi_disable();
        QSPI_TCFG = (QSPI_TCFG & ~QSPI_TCFG_FMOD) | QSPI_NORMAL_READ;
        qspi_enable();
        /* start the transfer by re-writing the address in QSPI_ADDR register */
        QSPI_ADDR = addr;

        while(rx_cnt > 0U) {
            while(((QSPI_STAT & (QSPI_FLAG_FT | QSPI_FLAG_TC)) == 0U) && (timeout > 0U)){
                timeout--;
            }
            *rdata++ = *(uint8_t *)(QSPI + 0x00000020U);
            rx_cnt--;
        }
    }
}

/*!
    \brief      abort the current transmission (API_ID: 0x000FU)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_transmission_abort(void)
{
    uint16_t timeout = QSPI_DATA_ABORT_TOMEOUT;
    QSPI_CTL |= (uint32_t)(QSPI_CTL_ABORT);
    /* wait abort bit reset */
    while(((QSPI_CTL & QSPI_CTL_ABORT) == QSPI_CTL_ABORT) && (timeout > 0U)){
        timeout--;
    };
}

/*!
    \brief      enable QSPI output clock delay (API_ID: 0x0010U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_output_clock_delay_enable(void)
{
    QSPI_CTL |= (uint32_t)QSPI_CTL_OCKDEN;
}

/*!
    \brief      disable QSPI output clock delay (API_ID: 0x0011U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_output_clock_delay_disable(void)
{
    QSPI_CTL &= (uint32_t)(~QSPI_CTL_OCKDEN);
}

/*!
    \brief      configure output clock delay (API_ID: 0x0012U)
    \param[in]  ck_delay: 0~15
    \param[out] none
    \retval     none
*/
void qspi_output_clock_delay_config(uint32_t ck_delay)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_QSPI_CLOCK_DELAY(ck_delay)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0012U), ERR_PARAM_INVALID);
    } else
#endif
    {
        QSPI_CTL &= (uint32_t)(~QSPI_CTL_OCKDV);
        QSPI_CTL |= (uint32_t)(ck_delay << CTL_OUTPUT_CK_DELAY_OFFSET);
    }
}

/*!
    \brief      config qspi sample shift (API_ID: 0x0013U)
    \param[in]  sample_shift1: QSPI sample shift1, support use with 2
                only one parameter can be selected which are shown as below:
      \arg        QSPI_SAMPLE_SHIFTING_NONE: no shift when sample data
      \arg        QSPI_SAMPLE_SHIFTING_HALFCYCLE: 1/2 sck cycle shift
    \param[in]  sample_shift2: QSPI sample shift2, support use with 1
                only one parameter can be selected which are shown as below:
      \arg        QSPI_SHIFTING_NONE: no shift when sample data
      \arg        QSPI_SHIFTING_1_CYCLE: 1 sck cycle shift
      \arg        QSPI_SHIFTING_2_CYCLE: 2 sck cycle shift
      \arg        QSPI_SHIFTING_3_CYCLE: 3 sck cycle shift
      \arg        QSPI_SHIFTING_4_CYCLE: 4 sck cycle shift
      \arg        QSPI_SHIFTING_5_CYCLE: 5 sck cycle shift
      \arg        QSPI_SHIFTING_6_CYCLE: 6 sck cycle shift
      \arg        QSPI_SHIFTING_7_CYCLE: 7 sck cycle shift
    \param[out] none
    \retval     none
*/
void qspi_sample_shift_config(uint32_t sample_shift1, uint32_t sample_shift2)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_QSPI_SAMPLE_SHIFT1(sample_shift1)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0013U), ERR_PARAM_INVALID);
    } else if(NOT_QSPI_SAMPLE_SHIFT2(sample_shift2)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0013U), ERR_PARAM_INVALID);
    } else
#endif
    {
        if(QSPI_SAMPLE_SHIFTING_NONE == sample_shift1) {
            QSPI_CTL &= (uint32_t)(~QSPI_CTL_SSAMPLE);
        } else {
            QSPI_CTL |= sample_shift1;
        }

        if(QSPI_SHIFTING_NONE == sample_shift2) {
            QSPI_DCFG &= (uint32_t)(~QSPI_DCFG_RXSFT);
        } else {
            QSPI_DCFG |= sample_shift2;
        }
    }
}

/*!
    \brief      select receive clock (API_ID: 0x0014U)
    \param[in]  rcksel: receive clock select
                only one parameter can be selected which is shown as below:
      \arg        QSPI_RECEIVE_CLOCK_SCK
      \arg        QSPI_RECEIVE_CLOCK_DQS
    \param[out] none
    \retval     none
*/
void qspi_receive_clock_sel(uint32_t rcksel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_QSPI_RCKSEL(rcksel)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0014U), ERR_PERIPH);
    } else
#endif
    {
        if(QSPI_RECEIVE_CLOCK_SCK == rcksel) {
            QSPI_DCFG &= (uint32_t)(~QSPI_DCFG_RCKSEL);
        } else {
            QSPI_DCFG |= rcksel;
        }
    }
}

/*!
    \brief      enable QSPI delay scan (API_ID: 0x0015U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_delay_scan_enable(void)
{
    QSPI_DCFG |= (uint32_t)QSPI_DCFG_DLYSCEN;
}

/*!
    \brief      disable QSPI delay scan (API_ID: 0x0016U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_delay_scan_disable(void)
{
    QSPI_DCFG &= (uint32_t)(~QSPI_DCFG_DLYSCEN);
}

/*!
    \brief      csn falls and rises 1 or 2 sck cycles select (API_ID: 0x0017U)
    \param[in]  csn_cycle: receive clock select
                only one parameter can be selected which are shown as below:
      \arg        QSPI_CSN_1_CYCLE: csn falls and rises 1 sck cycle
      \arg        QSPI_CSN_2_CYCLE: csn falls and rises 2 sck cycle
    \param[out] none
    \retval     none
*/
void qspi_csn_edge_cycle(uint32_t csn_cycle)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_QSPI_CSN_CLOCK(csn_cycle)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0017U), ERR_PERIPH);
    } else
#endif
    {
        if(QSPI_CSN_1_CYCLE == csn_cycle) {
            QSPI_DCFG &= (uint32_t)(~QSPI_DCFG_CSNCKM);
        } else {
            QSPI_DCFG |= csn_cycle;
        }
    }
}

/*!
    \brief      get QSPI flag status (API_ID: 0x0018U)
    \param[in]  flag: QSPI flag
                only one parameter can be selected which are shown as below:
      \arg        QSPI_FLAG_BUSY: busy flag
      \arg        QSPI_FLAG_TERR: transfer error flag
      \arg        QSPI_FLAG_TC: transfer complete flag
      \arg        QSPI_FLAG_FT: FIFO threshold flag
      \arg        QSPI_FLAG_RPMF: read polling match flag
      \arg        QSPI_FLAG_TMOUT: timeout flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus qspi_flag_get(uint32_t flag)
{
    FlagStatus reval = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_QSPI_FLAG(flag)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0018U), ERR_PERIPH);
    } else 
#endif
    {
        if((uint32_t)RESET != (QSPI_STAT & flag)) {
            reval = SET;
        }
    }
    return reval;
}

/*!
    \brief      clear QSPI flag status (API_ID: 0x0019U)
    \param[in]  flag: QSPI flag
                only one parameter can be selected which are shown as below:
      \arg        QSPI_FLAG_TERR: transfer error flag
      \arg        QSPI_FLAG_TC: transfer complete flag
      \arg        QSPI_FLAG_RPMF: read polling match flag
      \arg        QSPI_FLAG_TMOUT: timeout flag
    \param[out] none
    \retval     none
*/
void qspi_flag_clear(uint32_t flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_QSPI_FLAG_CLEAR(flag)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0019U), ERR_PERIPH);
    } else
#endif
    {
        QSPI_STATC |= (uint32_t)flag;
    }
}

/*!
    \brief      enable QSPI interrupt (API_ID: 0x001AU)
    \param[in]  interrupt: QSPI interrupt
                only one parameter can be selected which is shown as below:
      \arg        QSPI_INT_TC: transfer complete interrupt
      \arg        QSPI_INT_FT: FIFO threshold interrupt
      \arg        QSPI_INT_TERR: transfer error interrupt
      \arg        QSPI_INT_RPMF: read polling match interrupt
      \arg        QSPI_INT_TMOUT: timeout interrupt
    \param[out] none
    \retval     none
*/
void qspi_interrupt_enable(uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_QSPI_INTERRUPT(interrupt)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x001AU), ERR_PERIPH);
    } else
#endif
    {
        QSPI_CTL |= (uint32_t)interrupt;
    }
}

/*!
    \brief      disable QSPI interrupt (API_ID: 0x001BU)
    \param[in]  interrupt: QSPI interrupt
                only one parameter can be selected which is shown as below:
      \arg        QSPI_INT_TC: transfer complete interrupt
      \arg        QSPI_INT_FT: FIFO threshold interrupt
      \arg        QSPI_INT_TERR: transfer error interrupt
      \arg        QSPI_INT_RPMF: read polling match interrupt
      \arg        QSPI_INT_TMOUT: timeout interrupt
    \param[out] none
    \retval     none
*/
void qspi_interrupt_disable(uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_QSPI_INTERRUPT(interrupt)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x001BU), ERR_PERIPH);
    } else
#endif
    {
        QSPI_CTL &= ~(uint32_t)interrupt;
    }
}

/*!
    \brief      get QSPI interrupt flag status (API_ID: 0x001CU)
    \param[in]  int_flag: QSPI interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        QSPI_INT_FLAG_TERR: transfer error flag
      \arg        QSPI_INT_FLAG_TC: transfer complete flag
      \arg        QSPI_INT_FLAG_FT: FIFO threshold flag
      \arg        QSPI_INT_FLAG_RPMF: read polling match flag
      \arg        QSPI_INT_FLAG_TMOUT: timeout flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus qspi_interrupt_flag_get(uint32_t int_flag)
{
    FlagStatus reval = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_QSPI_INTERRUPT_FLAG(int_flag)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x001CU), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg1 = QSPI_STAT;
        uint32_t reg2 = QSPI_CTL;

        switch(int_flag) {
            /* QSPI transfer error interrupt flag */
            case QSPI_INT_FLAG_TERR:
                reg1 = reg1 & QSPI_STAT_TERR;
                reg2 = reg2 & QSPI_CTL_TERRIE;
                break;
            /* QSPI transfer complete interrupt flag */
            case QSPI_INT_FLAG_TC:
                reg1 = reg1 & QSPI_STAT_TC;
                reg2 = reg2 & QSPI_CTL_TCIE;
                break;
            /* QSPI FIFO threshold interrupt flag */
            case QSPI_INT_FLAG_FT:
                reg1 = reg1 & QSPI_STAT_FT;
                reg2 = reg2 & QSPI_CTL_FTIE;
                break;
            /* QSPI status match interrupt flag */
            case QSPI_INT_FLAG_RPMF:
                reg1 = reg1 & QSPI_STAT_RPMF;
                reg2 = reg2 & QSPI_CTL_RPMFIE;
                break;
            /* QSPI timeout interrupt flag */
            case QSPI_INT_FLAG_TMOUT:
                reg1 = reg1 & QSPI_STAT_TMOUT;
                reg2 = reg2 & QSPI_CTL_TMOUTIE;
                break;
            default :
                break;
        }
        /* get QSPI interrupt flag status */
        if((reg1 != 0U) && (reg2 != 0U)) {
            reval = SET;
        } else {
            reval = RESET;
        }
    }
    return reval;
}

/*!
    \brief      clear QSPI interrupt flag status (API_ID: 0x001DU)
    \param[in]  int_flag: QSPI interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        QSPI_INT_FLAG_TERR: transfer error flag
      \arg        QSPI_INT_FLAG_TC: transfer complete flag
      \arg        QSPI_INT_FLAG_RPMF: read polling match flag
      \arg        QSPI_INT_FLAG_TMOUT: timeout flag
    \param[out] none
    \retval     none
*/
void qspi_interrupt_flag_clear(uint32_t int_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_QSPI_INTERRUPT_FLAG_CLEAR(int_flag)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x001DU), ERR_PERIPH);
    } else
#endif
    {
        QSPI_STATC |= (uint32_t)int_flag;
    }
}

/*!
    \brief      configure QSPI functional mode
    \param[in]  cmd: QSPI command parameter initialization stuct members of the structure
                             and the member values are shown as below:
                  instruction_mode: QSPI_INSTRUCTION_NONE, QSPI_INSTRUCTION_1_LINE,
                                    QSPI_INSTRUCTION_2_LINES, QSPI_INSTRUCTION_4_LINES
                  instruction: reference flash commands description
                  addr_mode: QSPI_ADDR_NONE, QSPI_ADDR_1_LINE, QSPI_ADDR_2_LINES, QSPI_ADDR_4_LINES
                  addr_size: QSPI_ADDR_8_BITS, QSPI_ADDR_16_BITS, QSPI_ADDR_24_BITS, QSPI_ADDR_32_BITS
                  addr: 0-flash size
                  altebytes_mode: QSPI_ALTE_BYTES_NONE, QSPI_ALTE_BYTES_1_LINE,
                                  QSPI_ALTE_BYTES_2_LINES, QSPI_ALTE_BYTES_4_LINES
                  altebytes_size: QSPI_ALTE_BYTES_8_BITS, QSPI_ALTE_BYTES_16_BITS,
                                  QSPI_ALTE_BYTES_24_BITS, QSPI_ALTE_BYTES_32_BITS
                  altebytes: 0-0xFFFFFFFF
                  dummycycles: between 0 and 31
                  data_mode: QSPI_DATA_NONE, QSPI_DATA_1_LINE, QSPI_DATA_2_LINES, QSPI_DATA_4_LINES
                  data_length: 0-0xFFFFFFFF
                  sioo_mode: QSPI_SIOO_INST_EVERY_CMD, QSPI_SIOO_INST_ONLY_FIRST_CMD
                  trans_rate: QSPI_SDR_MODE, QSPI_DDR_MODE
                  trans_delay: QSPI_DDR_HOLD_DISABLE, QSPI_DDR_HOLD_ENABLE
    \param[in]  functionalmode: QSPI functional mode select
                only one parameter can be selected which is shown as below:
      \arg        QSPI_NORMAL_WRITE
      \arg        QSPI_NORMAL_READ
      \arg        QSPI_READ_POLLING
      \arg        QSPI_MEMORY_MAPPED
    \param[out] none
    \retval     none
*/
static void qspi_config(qspi_command_struct *cmd, uint32_t functionalmode)
{
    if((cmd->data_mode != QSPI_DATA_NONE) && (functionalmode != QSPI_MEMORY_MAPPED)) {
        /* configure QSPI_DTLEN register with the number of data to read or write */
        QSPI_DTLEN = cmd->data_length - 1U;
    }

    if(cmd->altebytes_mode != QSPI_ALTE_BYTES_NONE) {
        /* configure QSPI_ALTE register with alternate bytes value */
        QSPI_ALTE = cmd->altebytes;
    }
    if((cmd->data_mode != QSPI_DATA_NONE) || (cmd->altebytes_mode != QSPI_ALTE_BYTES_NONE) || \
            (cmd->addr_mode != QSPI_ADDR_NONE) || (cmd->instruction_mode != QSPI_INSTRUCTION_NONE)) {

        QSPI_TCFG = cmd->data_mode | (cmd->dummycycles << TCFG_DUMYC_OFFSET) | cmd->sioo_mode |
                    cmd->altebytes_size | cmd->altebytes_mode |
                    cmd->addr_size | cmd->addr_mode | cmd->instruction_mode |
                    cmd->instruction | cmd->trans_rate | cmd->trans_delay | functionalmode;
    }

    if((cmd->addr_mode != QSPI_ADDR_NONE) && (functionalmode != QSPI_MEMORY_MAPPED)) {
        /* configure QSPI_ADDR register with address value */
        QSPI_ADDR = cmd->addr;
    }
}

/*!
    \brief      enable CPDM (API_ID: 0x001EU)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cpdm_enable(void)
{
    /* enable CPDM */
    CPDM_CTL |= (uint32_t)CPDM_CTL_CPDMEN;
}

/*!
    \brief      disable CPDM (API_ID: 0x001FU)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cpdm_disable(void)
{
    /* disable CPDM */
    CPDM_CTL &= ~(uint32_t)CPDM_CTL_CPDMEN;
}

/*!
    \brief      enable CPDM delay line sample module (API_ID: 0x0020U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cpdm_delayline_sample_enable(void)
{
    /* enable CPDM delay line sample module */
    CPDM_CTL |= (uint32_t)CPDM_CTL_DLSEN;
}

/*!
    \brief      disable CPDM delay line sample module (API_ID: 0x0021U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cpdm_delayline_sample_disable(void)
{
    /* disable CPDM delay line sample module */
    CPDM_CTL &= ~(uint32_t)CPDM_CTL_DLSEN;
}

/*!
    \brief      select CPDM output clock phase (API_ID: 0x0022U)
    \param[in]  output_clock_phase: the output clock phase, refer to cpdm_output_phase_enum
                only one parameter can be selected which is shown as below:
      \arg        CPDM_OUTPUT_PHASE_SELECTION_0: output clock phase = input clock
      \arg        CPDM_OUTPUT_PHASE_SELECTION_1: output clock phase = input clock + 1 * UNIT delay
      \arg        CPDM_OUTPUT_PHASE_SELECTION_2: output clock phase = input clock + 2 * UNIT delay
      \arg        CPDM_OUTPUT_PHASE_SELECTION_3: output clock phase = input clock + 3 * UNIT delay
      \arg        CPDM_OUTPUT_PHASE_SELECTION_4: output clock phase = input clock + 4 * UNIT delay
      \arg        CPDM_OUTPUT_PHASE_SELECTION_5: output clock phase = input clock + 5 * UNIT delay
      \arg        CPDM_OUTPUT_PHASE_SELECTION_6: output clock phase = input clock + 6 * UNIT delay
      \arg        CPDM_OUTPUT_PHASE_SELECTION_7: output clock phase = input clock + 7 * UNIT delay
      \arg        CPDM_OUTPUT_PHASE_SELECTION_8: output clock phase = input clock + 8 * UNIT delay
      \arg        CPDM_OUTPUT_PHASE_SELECTION_9: output clock phase = input clock + 9 * UNIT delay
      \arg        CPDM_OUTPUT_PHASE_SELECTION_10: output clock phase = input clock + 10 * UNIT delay
      \arg        CPDM_OUTPUT_PHASE_SELECTION_11: output clock phase = input clock + 11 * UNIT delay
      \arg        CPDM_OUTPUT_PHASE_SELECTION_12: output clock phase = input clock + 12 * UNIT delay
    \param[out] none
    \retval     none
*/
void cpdm_output_clock_phase_select(cpdm_output_phase_enum output_clock_phase)
{
    uint32_t reg;

    reg = CPDM_CFG;
    reg &= CPDM_CPSEL_MASK;
    /* select CPDM output clock phase */
    reg |= (uint32_t)output_clock_phase;
    CPDM_CFG = reg;
}

/*!
    \brief      configure CPDM delay step (API_ID: 0x0023U)
    \param[in]  delay_step: 0 ~ 127
    \param[out] none
    \retval     none
*/
void cpdm_delay_step_config(uint8_t delay_step)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CPDM_DELAY_STEP_COUNT(delay_step)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0023U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        reg = CPDM_CFG;
        reg &= CPDM_DLSTCNT_MASK;
        /* configure delay step */
        reg |= ((uint32_t)delay_step << CPDM_DLSTCNT_OFFSET);
        CPDM_CFG = reg;
    }
}

/*!
    \brief      get delay line length valid flag (API_ID: 0x0024U)
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus cpdm_delayline_length_valid_flag_get(void)
{
    uint32_t reg;
    FlagStatus reval;

    reg = CPDM_CFG;
    if(CPDM_DLLENF_MASK == (reg & CPDM_DLLENF_MASK)) {
        reval = SET;
    } else {
        reval = RESET;
    }

    return reval;
}

/*!
    \brief      get delay line length (API_ID: 0x0025U)
    \param[in]  none
    \param[out] none
    \retval     the value of delay line length, 0x00~0xFFF
*/
uint16_t cpdm_delayline_length_get(void)
{
    return (uint16_t)((CPDM_CFG & CPDM_DLLEN_MASK) >> CPDM_DLLEN_OFFSET);
}

/*!
    \brief      configure CPDM clock output (API_ID: 0x0026U)
    \param[in]  output_clock_phase: the output clock phase, refer to cpdm_output_phase_enum
                only one parameter can be selected which is shown as below:
      \arg        CPDM_OUTPUT_PHASE_SELECTION_0: output clock phase = input clock
      \arg        CPDM_OUTPUT_PHASE_SELECTION_1: output clock phase = input clock + 1 * UNIT delay
      \arg        CPDM_OUTPUT_PHASE_SELECTION_2: output clock phase = input clock + 2 * UNIT delay
      \arg        CPDM_OUTPUT_PHASE_SELECTION_3: output clock phase = input clock + 3 * UNIT delay
      \arg        CPDM_OUTPUT_PHASE_SELECTION_4: output clock phase = input clock + 4 * UNIT delay
      \arg        CPDM_OUTPUT_PHASE_SELECTION_5: output clock phase = input clock + 5 * UNIT delay
      \arg        CPDM_OUTPUT_PHASE_SELECTION_6: output clock phase = input clock + 6 * UNIT delay
      \arg        CPDM_OUTPUT_PHASE_SELECTION_7: output clock phase = input clock + 7 * UNIT delay
      \arg        CPDM_OUTPUT_PHASE_SELECTION_8: output clock phase = input clock + 8 * UNIT delay
      \arg        CPDM_OUTPUT_PHASE_SELECTION_9: output clock phase = input clock + 9 * UNIT delay
      \arg        CPDM_OUTPUT_PHASE_SELECTION_10: output clock phase = input clock + 10 * UNIT delay
      \arg        CPDM_OUTPUT_PHASE_SELECTION_11: output clock phase = input clock + 11 * UNIT delay
      \arg        CPDM_OUTPUT_PHASE_SELECTION_12: output clock phase = input clock + 12 * UNIT delay
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus cpdm_clock_output(cpdm_output_phase_enum output_clock_phase)
{
    ErrStatus reval = SUCCESS;
    uint32_t reg;
    uint32_t reg_cfg;
    uint32_t delay_count;
    uint32_t timeout = 0U;

