sorosaulong-ux/gd32-test-project/Library/gd32a7xx_qspi.c
    /* enable CPDM and delay line sample module */
    CPDM_CTL = 0U;
    CPDM_CTL = CPDM_CTL_CPDMEN | CPDM_CTL_DLSEN;
    /* configure CPDM output clock phase to the max value (12) */
    reg = CPDM_CFG;
    reg &= CPDM_CPSEL_MASK;
    reg |= CPDM_MAX_PHASE;
    CPDM_CFG = (uint32_t)reg;

    for(delay_count = 0U; delay_count <= CPDM_MAX_DELAY_STEP_COUNT; delay_count++) {
        reg = CPDM_CFG;
        reg &= CPDM_DLSTCNT_MASK;
        /* configure delay line step count */
        reg |= (delay_count << CPDM_DLSTCNT_OFFSET);
        CPDM_CFG = (uint32_t)reg;

        /* Wait for the delay line length to be valid */
        while(CPDM_CFG_DLLENF != (CPDM_CFG & CPDM_CFG_DLLENF)) {
            timeout++;
            if(timeout > CPDM_MAX_TIMEOUT)
            {
                timeout = 0;
                reval = ERROR;
                break;
            }
        }
        if(ERROR == reval) {
            break;
        }

        reg_cfg = CPDM_CFG;
        if((((reg_cfg >> CPDM_DLLEN_OFFSET) & CPDM_DLLEN_10_0_MASK) > 0U) &&
                ((CPDM_DLLEN_11 != (reg_cfg & CPDM_DLLEN_11)) || (CPDM_DLLEN_10 != (reg_cfg & CPDM_DLLEN_10)))) {
            break;
        }
    }

    if(delay_count > CPDM_MAX_DELAY_STEP_COUNT) {
        /* delay line length is not valid */
        reval = ERROR;
    }

    if (SUCCESS == reval) {
        /* enable CPDM and delay line sample module */
        CPDM_CTL = 0U;
        CPDM_CTL = CPDM_CTL_CPDMEN | CPDM_CTL_DLSEN;
        /* select the output clock phase */
        reg = CPDM_CFG;
        reg &= CPDM_CPSEL_MASK;
        reg |= (uint32_t)output_clock_phase;
        CPDM_CFG = (uint32_t)reg;
        /* disable delay line sample module */
        CPDM_CTL = CPDM_CTL_CPDMEN;
    }

    return reval;
}

/*!
    \brief      get QSPI TMR alarm status (API_ID: 0x0027U)
    \param[in]  tmr_alarm: tmr alarm status
                only one parameter can be selected which is shown as below:
        \arg      QSPI_TMRALM_CTL_FLAG
        \arg      QSPI_TMRALM_DTLEN_FLAG
        \arg      QSPI_TMRALM_TCFG_FLAG
        \arg      QSPI_TMRALM_FLUSH_FLAG
    \param[out] none
    \retval     SET or RESET
*/
FlagStatus qspi_tmr_alarm_status_get(uint32_t tmr_alarm)
{
    FlagStatus reval = RESET;
    uint32_t tmralm;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_QSPI_TMRALARM_STATUS(tmr_alarm)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0027U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* read current TMR register value */
        tmralm = QSPI_TMR;

        /* check if the specified alarm flag is set */
        if((uint32_t)RESET != (tmralm & tmr_alarm)) {
            reval = SET;
        } else {
            reval = RESET;
        }
    }
    return reval;
}

/*!
    \brief      clear QSPI TMR alarm status (API_ID: 0x0028U)
    \param[in]  tmr_alarm: tmr alarm status
                one or more parameters can be selected which are shown as below:
        \arg      QSPI_TMRALM_CTL_FLAG
        \arg      QSPI_TMRALM_DTLEN_FLAG
        \arg      QSPI_TMRALM_TCFG_FLAG
        \arg      QSPI_TMRALM_FLUSH_FLAG
    \param[out] none
    \retval     none
*/
void qspi_tmr_alarm_status_clear(uint32_t tmr_alarm)
{
    uint32_t tmralm;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_QSPI_TMRALARM_STATUS_CLEAR(tmr_alarm)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0028U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* read current TMR register value */
        tmralm = QSPI_TMR;
        
        /* set the specified alarm bits to clear status flags */
        tmralm |= tmr_alarm;
        
        /* write back to TMR register */
        QSPI_TMR = tmralm;
    }
}

/*!
    \brief      enable QSPI TMR alarm (API_ID: 0x0029U)
    \param[in]  tmr_alarm: tmr alarm mask
                one or more parameters can be selected which are shown as below:
        \arg      QSPI_TMRALM_CTL
        \arg      QSPI_TMRALM_DTLEN
        \arg      QSPI_TMRALM_TCFG
        \arg      QSPI_TMRALM_FLUSH
    \param[out] none
    \retval     none
*/
void qspi_tmr_alarm_enable(uint32_t tmr_alarm)
{
    uint32_t tmralm;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_QSPI_TMRALARM_EN(tmr_alarm)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0029U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* read current TMR register value */
        tmralm = QSPI_TMR;
        tmralm &= ~(QSPI_TMR_ST0 | QSPI_TMR_ST1 | QSPI_TMR_ST2 | QSPI_TMR_ST3);
        
        /* enable the specified TMR alarms by setting their bits */
        tmralm |= tmr_alarm;
        
        /* write back to TMR register */
        QSPI_TMR = tmralm;
    }
}

/*!
    \brief      disable QSPI TMR alarm (API_ID: 0x002AU)
    \param[in]  tmr_alarm: tmr alarm mask
                one or more parameters can be selected which are shown as below:
        \arg      QSPI_TMRALM_CTL
        \arg      QSPI_TMRALM_DTLEN
        \arg      QSPI_TMRALM_TCFG
        \arg      QSPI_TMRALM_FLUSH
    \param[out] none
    \retval     none
*/
void qspi_tmr_alarm_disable(uint32_t tmr_alarm)
{
    uint32_t tmralm;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_QSPI_TMRALARM_EN(tmr_alarm)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x002AU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* read current TMR register value */
        tmralm = QSPI_TMR;
        tmralm &= ~(QSPI_TMR_ST0 | QSPI_TMR_ST1 | QSPI_TMR_ST2 | QSPI_TMR_ST3);
        
        /* disable the specified TMR alarms by clearing their bits */
        tmralm &= ~tmr_alarm;
        
        /* write back to TMR register */
        QSPI_TMR = tmralm;
    }
}
